#+title: Installing emacs on buster
#+subtitle: so many ways to get software
#+tags: emacs, debian, flatpak
#+date: 2021-03-05

I've already [[https://willschenk.com/articles/2020/upgrading_emacs_on_debian/][written about installing emacs-snapshot]] on debian buster, here are two additional ways.  The first is to use flatpak, and the other is to build from source.

* Flatpack

#+begin_src bash
sudo apt-get install flatpak
sudo apt install gnome-software-plugin-flatpak
sudo flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo
#+end_src

Then:

#+begin_src bash
sudo flatpak install flathub org.gnu.emacs
#+end_src

And running it:

#+begin_src bash
flatpak run org.gnu.emacs
#+end_src

You can then pin it in your dock and you are good to go.


* From Source

For buster debian, make sure you have the deb-src lines in your =/etc/apt/sources.list=

#+begin_src bash
deb http://deb.debian.org/debian buster main contrib non-free
deb-src http://deb.debian.org/debian buster main contrib non-free

deb http://deb.debian.org/debian-security/ buster/updates main contrib non-free
deb-src http://deb.debian.org/debian-security/ buster/updates main contrib non-free

deb http://deb.debian.org/debian buster-updates main contrib non-free
deb-src http://deb.debian.org/debian buster-updates main contrib non-free
#+end_src

Then lets add the dependancies and pull down the emacs source code:

#+begin_src bash
  sudo apt update

  # Make sure you have the builddeps

  sudo apt build-dep emacs25

  # Also install native json parsing

  sudo apt-get install libjansson4 libjansson-dev libmagickcore-dev

  # Download the monster
  git clone --depth 1 --branch emacs-27 https://git.savannah.gnu.org/git/emacs.git
#+end_src

Now we can run =./authgen.sh= and =./configure=:

#+begin_src bash
  cd emacs
  ./autogen.sh
  ./configure
  make
#+end_src

You can test this out by running:

#+begin_src bash
  src/emacs
#+end_src

Or just install it:

#+begin_src bash
  sudo make install
#+end_src

** =.desktop= file:

This is what I have in my =~/.local/share/applications/emacs.desktop=:

#+begin_src ini
[Desktop Entry]
Version=1.0
Name=Emacs 27
GenericName=Text Editor
Comment=View and edit files
MimeType=text/english;text/plain;text/x-makefile;text/x-c++hdr;text/x-c++src;text/x-chdr;text/x-csrc;text/x-java;text/x-moc;text/x-pascal;text/x-tcl;text/x-tex;application/x-shellscript;text/x-c;text/x-c++;
Exec=/usr/local/bin/emacs %F
TryExec=emacs
Icon=emacs
StartWMClass=emacs
Type=Application
Terminal=false
Categories=Utility;Development;TextEditor;
#+end_src

* Native json support test

The whole point of this for me was to see if we have native json
support.  We can test this with:

#+begin_src elisp
(if (functionp 'json-serialize)
  (message "Native JSON is available")
(message "Native JSON is *not* available"))
#+end_src

#+RESULTS:
: Native JSON is available

* References

1. https://flatpak.org/setup/Debian/
2. https://www.masteringemacs.org/article/speed-up-emacs-libjansson-native-elisp-compilation
3. https://www.emacswiki.org/emacs/EmacsSnapshotAndDebian
4. https://wiki.debian.org/SourcesList
